Sandgreenpanda/2026-ESP32/src/main.cpp
        while (remaining > 0) {
            size_t to_read = (remaining < sizeof(buffer)) ? remaining : sizeof(buffer);
            rc = ssh_scp_read(scp, buffer, to_read);
            if (rc == SSH_ERROR) {
                Serial.printf("Error receiving file data: %s\n", ssh_get_error(session));
                targetFile.close();
                ssh_scp_close(scp);
                ssh_scp_free(scp);
                return rc;
            }

            Serial.write((const uint8_t *)buffer, rc);
            targetFile.write((const uint8_t *)buffer, rc);
            remaining -= rc;
        }

        targetFile.flush();
        targetFile.close();

        Serial.printf("Done\n");
        Serial.println();

        rc = ssh_scp_pull_request(scp);
        if (rc != SSH_SCP_REQUEST_EOF) {
            Serial.printf("Unexpected request: %s\n", ssh_get_error(session));
            ssh_scp_close(scp);
            ssh_scp_free(scp);
            return SSH_ERROR;
        }

        ssh_scp_close(scp);
        ssh_scp_free(scp);
        return SSH_OK;
    }
};

String FuncReadTemplate(String path, std::initializer_list<std::pair<String, String>> args) {
    String file = SD.open(path, FILE_READ).readString();

    for (const auto &arg : args) {
        file.replace(arg.first, arg.second);
    }

    return file;
}

ssh_conn hp_1_session("192.168.1.34", "alext", "Home1918");

int ex_main() {
    Serial.println("Exec main begin");

    int lastHandleKeepAlive = millis();

    if (hp_1_session.connect() != NULL) {
        hp_1_session.conn = true;
    }

    Serial.println("loop begin");
    while (1) {

        // Read the ssh data and send it to the websocket clients
        if (!hp_1_session.conn || hp_1_session.read() < 1) { // Returns rbytes, checks for no-bytes-transferred/error
            // If the connection is down, dont read by short circuit evaluation
            vTaskDelay(1 / portTICK_PERIOD_MS);
        }

        if (ssh_command != "" && hp_1_session.conn) {
            // Write the websocket data to ssh
            hp_1_session.write(ssh_command);
            ssh_command = ""; // Reset command to prevent infinite loop
        } else if (upload_command != "" && hp_1_session.conn) {
            hp_1_session.scp_write(upload_command);
            upload_command = "";
        } else if (scp_command != "" && hp_1_session.conn) {
            hp_1_session.scp_read(scp_command);
            scp_command = "";
        } else if (hp_1_status_req) {
            String cmd_output = hp_1_session.exec_cmd("echo alive");
            cmd_output.trim();
            hp_1_session.conn = (cmd_output == "alive");
            Serial.println(cmd_output);
            if (!hp_1_session.conn) {
                Serial.println("HP1 Disconnect! Reconnecting...");
                hp_1_session.brutal_exception();
                if (hp_1_session.connect() != NULL) {
                    hp_1_session.conn = true;
                } else {
                    hp_1_session.conn = false;
                }
            }
            hp_1_status_req = false;
        } else {
            if (millis() - lastHandleKeepAlive >= 10000 && hp_1_session.conn) { // Every 10 seconds
                Serial.println("Keep Alive Check");
                hp_1_session.keep_alive();
                lastHandleKeepAlive = millis();
            }
        }
    }
    hp_1_session.conn = true;
    hp_1_session.disconnect();

    return 0;
}

void controlTask(void *pvParameter) {
    wifiMulti.run();
    Serial.println("Wifi run finished");
    wait_for_wifi_exec(ex_main);
}

void serverTask(void *params) {
    // Server task in different thread on same core for async behavior.
    Serial.println("Creating a new self-signed certificate.");
    Serial.println("This may take up to a minute, so be patient ;-)");

    cert = new SSLCert();

    esp_task_wdt_delete(NULL);

    int createCertResult = createSelfSignedCert(
        *cert,
        KEYSIZE_2048,
        "CN=10.47.6.92,O=Sandgreenpanda,C=DE",
        "20190101000000",
        "20300101000000");

    esp_task_wdt_add(NULL);

    // Now check if creating that worked
    if (createCertResult != 0) {
        Serial.printf("Cerating certificate failed. Error Code = 0x%02X, check SSLCert.hpp for details", createCertResult);
        while (true)
            delay(500);
    }
    Serial.println("Creating the certificate was successful");

    secureServer = new HTTPSServer(cert, 443, MAX_CLIENTS);

    ResourceNode *nodeRoot = new ResourceNode("/", "GET", &handleRoot);
    ResourceNode *node404 = new ResourceNode("", "GET", &handle404);
    ResourceNode *nodeTerminal = new ResourceNode("/terminal", "GET", &handleTerminal);
    ResourceNode *nodeTerminalPost = new ResourceNode("/terminal_post", "POST", &handleTerminalPost);
    ResourceNode *nodeToggle1 = new ResourceNode("/toggle1", "POST", &handleToggle1);
    ResourceNode *nodeToggle2 = new ResourceNode("/toggle2", "POST", &handleToggle2);
    ResourceNode *nodeToggle3 = new ResourceNode("/toggle3", "POST", &handleToggle3);
    ResourceNode *nodeToggle4 = new ResourceNode("/toggle4", "POST", &handleToggle4);
    ResourceNode *nodeToggle5 = new ResourceNode("/toggle5", "POST", &handleToggle5);
    ResourceNode *nodeToggle6 = new ResourceNode("/toggle6", "POST", &handleToggle6);
    ResourceNode *nodeAdmin = new ResourceNode("/admin", "GET", &handleAdmin);
    ResourceNode *nodeLogIn = new ResourceNode("/admin", "POST", &handleLogIn);

    ResourceNode *nodeHandleFan = new ResourceNode("/fan", "POST", &handleFan);
    ResourceNode *nodeHandleStyle = new ResourceNode("/style.css", "GET", &handleStyle);
    ResourceNode *nodeHandleComputers = new ResourceNode("/computers", "GET", &handleComputers);

    ResourceNode *nodeHandleTerminalUpdate = new ResourceNode("/update", "GET", &handleTerminalUpdate);
    ResourceNode *nodehandleSSHpage = new ResourceNode("/sshpage", "GET", &handleSSHpage);
    WebsocketNode *sshNode = new WebsocketNode("/ssh", &SSHHandler::create);
    ResourceNode *nodeSSHStatus1 = new ResourceNode("/SSH1Status", "POST", &handleSSHStatus1);
    ResourceNode *nodeSCP = new ResourceNode("/scp", "POST", &handleSCP);
    ResourceNode *nodeUPLOAD = new ResourceNode("/upload", "POST", &handleUPLOAD);

