Sandgreenpanda/2026-ESP32/src/main.cpp
    // Adding the node to the server works in the same way as for all other nodes
    secureServer->registerNode(sshNode);
    secureServer->registerNode(nodehandleSSHpage);

    // Add the root node to the server
    secureServer->registerNode(nodeRoot);
    secureServer->registerNode(nodeSCP);
    // Add the 404 not found node to the server.
    secureServer->setDefaultNode(node404);
    // Add Terminal node
    secureServer->registerNode(nodeTerminal);
    secureServer->registerNode(nodeTerminalPost);
    secureServer->registerNode(nodeSSHStatus1);
    secureServer->registerNode(nodeToggle1);
    secureServer->registerNode(nodeToggle2);
    secureServer->registerNode(nodeToggle3);
    secureServer->registerNode(nodeToggle4);
    secureServer->registerNode(nodeToggle5);
    secureServer->registerNode(nodeToggle6);
    secureServer->registerNode(nodeHandleFan);
    secureServer->registerNode(nodeHandleComputers);

    secureServer->registerNode(nodeAdmin);
    secureServer->registerNode(nodeLogIn);

    secureServer->registerNode(nodeHandleStyle);

    secureServer->registerNode(nodeHandleTerminalUpdate);
    secureServer->registerNode(nodeUPLOAD);

    secureServer->addMiddleware(&middlewareAuth);

    Serial.println("Starting server...");
    secureServer->start();
    if (secureServer->isRunning()) {
        Serial.println("Server ready.");

        while (true) {
            secureServer->loop();
            delay(1);
        }
    }
}

void setup() {
    digitalWrite(LAPTOP_HP_1, LOW);
    digitalWrite(LAPTOP_HP_2, LOW);
    digitalWrite(LAPTOP_HP_3, LOW);
    digitalWrite(LAPTOP_LENOVO_1, LOW);
    digitalWrite(LAPTOP_ACER_1, LOW);
    digitalWrite(LAPTOP_ACER_2, LOW);
    pinMode(LAPTOP_HP_1, OUTPUT);
    pinMode(LAPTOP_HP_2, OUTPUT);
    pinMode(LAPTOP_HP_3, OUTPUT);
    pinMode(LAPTOP_LENOVO_1, OUTPUT);
    pinMode(LAPTOP_ACER_1, OUTPUT);
    pinMode(LAPTOP_ACER_2, OUTPUT);

    // Setup fans
    // First pin is declared to use chanel 0
    ledcSetup(0, PWM_FREQ, PWM_RESOLUTION);
    ledcAttachPin(PWM_FAN_1, 0);
    ledcWrite(0, 0); // Set initial fan speed to zero

    // Configure tachometer pin with interrupt
    pinMode(TACH_FAN_1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(TACH_FAN_1), tachISR, FALLING);

    // Initialize timing for fan tach
    lastTachTime = millis();

    WiFi.disconnect(true);

    WiFi.setSleep(false);

    wifiMulti.addAP("WC Devices", "0jebr9yrxh");
    wifiMulti.addAP("SPARK-UMRK2N", "NKUWEW7ZZV");

    devState = STATE_NEW;

    Serial.begin(115200);
    clientsMutex = xSemaphoreCreateMutex();
    if (clientsMutex == NULL) {
        Serial.println("Error: Failed to create clientsMutex!");
    }

    sdSPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (!SD.begin(SD_CS, sdSPI)) {
        Serial.println("SD mount failed");
    } else {
        Serial.println("SD mount successful");
    }

    // Begin the session storage
    Session_dict.Open("/data/session.kvdb");

    // Real password is initialed from the SD
    PASSWORD = SD.open("/crypto/password.txt", FILE_READ).readString();

    // Initialise the custom wifi event handler, which allows wait_for_wifi_exec to know when the ipv4 and v6 addresses have been set.
    esp_netif_init();
    esp_event_loop_create_default();
    esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, event_cb, NULL, NULL);
    esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, event_cb, NULL, NULL);

    // Stack size needs to be larger, so continue in a new task.

    xTaskCreatePinnedToCore(controlTask, "ctl", configSTACK, NULL, (tskIDLE_PRIORITY + 3), NULL, 0);

    // Make the server async and give it more ram
    xTaskCreatePinnedToCore(serverTask, "https443", 10240, NULL, 1, NULL, ARDUINO_RUNNING_CORE);
}

void loop() {
    delay(1);
    if (millis() - lastTachTime >= TACH_SAMPLE_TIME) {
        // Calculate RPM (2 pulses per revolution for most fans)
        unsigned long rpm = (tachPulseCount * 60000) / (TACH_SAMPLE_TIME * 2);
        Serial.println(rpm);
        tachPulseCount = 0;

        lastTachTime = millis();
    };
}

void middlewareAuth(HTTPRequest *req, HTTPResponse *res, std::function<void()> next) {
    String user_password_raw = req->getHeader("Cookie").c_str();
    String req_str = req->getRequestString().c_str();
    Serial.println(req_str);
    Serial.println(user_password_raw);

    // Extract the password from the cookie
    String Cookie = user_password_raw.substring(user_password_raw.lastIndexOf("=") + 1, user_password_raw.length());

    Serial.println(Cookie);

    Session_dict.clearErrorFlags();
    String user_password = Session_dict[Cookie.c_str()];
    if (Session_dict.errorFlags()) {
        user_password = "";
    }

    Serial.println("THE NEXT PRINT IS THE USER PASSWORD STRING:");
    Serial.println(user_password);
    Serial.println("THE NEXT PRINT IS THE USER PASSWORD STRING [END]");

    String user_password_trimmed = user_password.substring(user_password.lastIndexOf("=") + 1, user_password.length());

    Serial.println(user_password_trimmed);
    Serial.println(PASSWORD);

    if (user_password_trimmed == PASSWORD || req_str == "/style.css" || req_str == "/admin" || req_str == "/update") {
        if (user_password_trimmed == PASSWORD && req_str == "/admin") {
            res->setHeader("Content-Type", "text/html");
            res->println(FuncReadTemplate("/templates/log_out.html", {{"%LOGGED_IN%", "logout"}}));
        } else {
            next();
        }
    } else {
        res->setStatusCode(404);
        res->setHeader("Content-Type", "text/html");
        res->println(FuncReadTemplate("/templates/admin.html", {{"%LOGGED_IN%", "login"}, {"%ERROR%", "You need to log in to access this page"}}));
    }
}

void handleRoot(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/home.html", {{"%LOGGED_IN%", "logout"}, {"%TIME%", (String)((int)(millis() / 1000))}}));
}

void handleStyle(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/css");
    res->setHeader("Connection", "close");
    res->println(SD.open("/static/style.css", FILE_READ).readString());
};

void handleTerminal(HTTPRequest *req, HTTPResponse *res) {
    // Status code is 200 OK by default.
    // We want to deliver a simple HTML page, so we send a corresponding content type:
    res->setHeader("Connection", "close");
    res->setHeader("Content-Type", "text/html");

    res->println(FuncReadTemplate("/templates/terminal.html", {{"%LOGGED_IN%", "logout"}}));
};

void handleComputers(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/computers.html", {{"%LOGGED_IN%", "logout"}}));
};

WebsocketHandler *SSHHandler::create() {
    Serial.println("Creating new chat client!");
    SSHHandler *handler = new SSHHandler();
    if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClients[i] == nullptr) {
                activeClients[i] = handler;
                break;
            }
        }
        xSemaphoreGive(clientsMutex);
    } else {
        Serial.println("Unable to take variable lock");
    }
    return handler;
}

// When the websocket is closing, we remove the client from the array
void SSHHandler::onClose() {
    if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClients[i] == this) {
                activeClients[i] = nullptr;
            }
        }
        xSemaphoreGive(clientsMutex);
    } else {
        Serial.println("Unable to take variable lock");
    }
}

