Sandgreenpanda/2026-ESP32/src/main.cpp
void SSHHandler::onMessage(WebsocketInputStreambuf *inbuf) {
    if (inbuf == nullptr)
        return;
    // Get the input message
    // Dont know how this works, but I got it from the default websocket chat example
    // Might figure it out later
    std::string msg;
    int ch;
    while ((ch = inbuf->sbumpc()) != EOF) {
        msg.push_back(static_cast<char>(ch));
    }

    String ssh_msg = String(msg.c_str());

    Serial.println("ssh cmd received:");
    Serial.println(ssh_msg);

    ssh_command = ssh_msg;
}

void handleTerminalUpdate(HTTPRequest *req, HTTPResponse *res) {
    // sse headers

    //  res->setChunkedTransferMode();
    res->setHeader("Content-Type", "text/event-stream");
    res->setHeader("Cache-Control", "no-cache");
    res->setHeader("Connection", "keep-alive");

    // This code adds res to the list of clients that get sse updates
    res->print(""); // Force submit the headers

    // int rawSocketFd = req->getClientStartData()->_socket;
    sseClients.push_back(res); // res is a pointer.

    // res->Save(); // Pointers no longer disappear
    //  Allows for SSE

    // A client is removed upon a bad res->print in the ssh loop

    // res->flush();

    // This code was bad and blocked the whole thread
    /*
    while (1) {
        if (shh_output_send != "") {
            // res->write((uint8_t *)shh_output_send.c_str(), shh_output_send.length());
            res->print(shh_output_send);
            shh_output_send = "";
        }
        delay(10); // Let the esp complete other tasks in this thread
    }
    */
}

void handleTerminalPost(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/plain");

    // Stream the incoming request body to the response body
    // Theoretically, this should work for every request size.
    byte buffer[256];
    // HTTPReqeust::requestComplete can be used to check whether the
    // body has been parsed completely.
    String shh_input_string = "";
    while (!(req->requestComplete())) {
        // HTTPRequest::readBytes provides access to the request body.
        // It requires a buffer, the max buffer length and it will return
        // the amount of bytes that have been written to the buffer.
        size_t s = req->readBytes(buffer, 256);

        // The response does not only implement the Print interface to
        // write character data to the response but also the write function
        // to write binary data to the response.
        shh_input_string += String(buffer, s);
        // res->write(buffer, s);
    }
    Serial.println(shh_input_string);
    ssh_command = shh_input_string.substring(1, shh_input_string.length() - 1);
    while (ssh_command != "") {
        delay(1);
    }
    res->println(shh_output_string);
    shh_output_string = "";
}

void handleFan(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/plain");
    byte buffer[256];

    String fanSpeedInput = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        fanSpeedInput += String(buffer, s);
    }
    ledcWrite(0, fanSpeedInput.substring(1, fanSpeedInput.length() - 1).toInt());
    // ledcWrite(0, fanSpeedInput.substring(6).toInt()); // Substring cuts off: speed=
    // Serial.println(fanSpeedInput.substring(6).toInt());
}

void handleSCP(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "application/octet-stream");

    byte buffer[256];

    String filepath = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        filepath += String(buffer, s);
    }
    fp_encoded.urlcode = filepath;
    fp_encoded.urldecode();
    String fp = fp_encoded.strcode;
    scp_command = fp.substring(9, filepath.length());
    Serial.println(scp_command);

    while (scp_command != "") {
        delay(1);
    }

    String sdPath = "/downloads/file";

    fs::File file = SD.open(sdPath, FILE_READ);

    String fntemp = fp.substring(9, filepath.length());
    String filename = "attachment; filename=\"" + fntemp.substring(fntemp.lastIndexOf('/') + 1) + "\"";

    res->setHeader("Content-Disposition", filename.c_str());

    while (file.available()) {
        size_t bytesRead = file.read(buffer, sizeof(buffer));
        res->write(buffer, bytesRead);
    }

    file.close();
    SD.remove(sdPath);
}

void handleUPLOAD(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    String path = req->getHeader("path").c_str();

    byte buffer[256];
    String filedata = "";
    String Download_path = "/downloads/upload";

    fs::File targetFile = SD.open(Download_path, FILE_WRITE);
    if (!targetFile) {
        Serial.println("Failed to open file on SD for writing");
    }

    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);

        Serial.write((const uint8_t *)buffer, s);
        targetFile.write((const uint8_t *)buffer, s);
    }

    targetFile.flush();
    targetFile.close();

    upload_command = path;
};

// TODO: Update this to use one route
void handleToggle1(HTTPRequest *req, HTTPResponse *res) {
    Serial.println("1");
    digitalWrite(LAPTOP_HP_1, HIGH);
    delay(1000);
    digitalWrite(LAPTOP_HP_1, LOW);
}
void handleToggle2(HTTPRequest *req, HTTPResponse *res) {
    Serial.println("2");
    digitalWrite(LAPTOP_HP_2, HIGH);
    delay(1000);
    digitalWrite(LAPTOP_HP_2, LOW);
}
void handleToggle3(HTTPRequest *req, HTTPResponse *res) {
    Serial.println("3");
    digitalWrite(LAPTOP_LENOVO_1, HIGH);
    delay(1000);
    digitalWrite(LAPTOP_LENOVO_1, LOW);
}
void handleToggle4(HTTPRequest *req, HTTPResponse *res) {
    Serial.println("4");
    digitalWrite(LAPTOP_ACER_1, HIGH);
    delay(1000);
    digitalWrite(LAPTOP_ACER_1, LOW);
}
void handleToggle5(HTTPRequest *req, HTTPResponse *res) {
    Serial.println("5");
    digitalWrite(LAPTOP_ACER_2, HIGH);
    delay(1000);
    digitalWrite(LAPTOP_ACER_2, LOW);
}
void handleToggle6(HTTPRequest *req, HTTPResponse *res) {
    Serial.println("6");
    digitalWrite(LAPTOP_HP_3, HIGH);
    delay(1000);
    digitalWrite(LAPTOP_HP_3, LOW);
}

