Sandgreenpanda/2026-ESP32/src/main.cpp
void handleSSHStatus1(HTTPRequest *req, HTTPResponse *res) {
    hp_1_status_req = true;
    res->setHeader("Content-Type", "application/json");
    while (hp_1_status_req) {
        delay(1);
    }
    res->println(hp_1_session.conn);
}

void handleAdmin(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/admin.html", {{"%ERROR%", ""}, {"%LOGGED_IN%", "login"}}));
};

void handleSSHpage(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/websocket.html", {}));
};

void handleLogIn(HTTPRequest *req, HTTPResponse *res) {
    byte buffer[256];

    String data = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        data += String(buffer, s);
    }
    Serial.println("DATA HERE vvvv");
    Serial.println(data);

    String Session = data.substring(9, data.length());
    Serial.println(Session);

    res->setHeader("Content-Type", "text/html");

    byte shaResult[32]; // SHA-256 produces a 32-byte (256-bit) digest

    mbedtls_sha256_context ctx;
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0);

    mbedtls_sha256_update(&ctx, (const unsigned char *)Session.c_str(), Session.length());
    mbedtls_sha256_finish(&ctx, shaResult);
    mbedtls_sha256_free(&ctx);

    // Convert the bytes to c str
    std::string hexStr = std::accumulate(shaResult, shaResult + 32, std::string{}, [](std::string str, uint8_t byte) {char buf[3];sprintf(buf, "%02x", byte);return str + buf; });

    Session_dict[hexStr.c_str()] = Session;

    Serial.println("KVDB HEX, Session vvv");
    Serial.println(hexStr.c_str());
    Serial.println(Session);

    String Cookie = String("session=") + hexStr.c_str() + String("; Path=/; SameSite=Strict; Secure");
    res->setHeader("Set-Cookie", Cookie.c_str());
    res->setHeader("Content-Type", "text/html");
    if (Session == PASSWORD) {
        res->println(FuncReadTemplate("/templates/log_out.html", {{"%LOGGED_IN%", "login"}}));
    } else {
        res->println(FuncReadTemplate("/templates/computers.html", {{"%ERROR%", "The provided password was incorrect"}}));
    }
};

void handle404(HTTPRequest *req, HTTPResponse *res) {
    // Discard request body, if we received any
    // We do this, as this is the default node and may also server POST/PUT requests
    req->discardRequestBody();

    // Set the response status
    res->setStatusCode(404);
    res->setStatusText("Not Found");

    // Set content type of the response
    res->setHeader("Content-Type", "text/html");

    // Write a tiny HTML page
    res->println("<!DOCTYPE html>");
    res->println("<html>");
    res->println("<head><title>Not Found</title></head>");
    res->println("<body><h1>404 Not Found</h1><p>The requested resource was not found on this server.</p></body>");
    res->println("</html>");
}